app/views/payment_methods/index.html.erb

SELECT "payment_methods".* FROM "payment_methods"
---
      <div class="col-md-6">
        <%= form.text_field :search, value: params[:search], placeholder: t('payment_methods.search'), class: "form-control" %>