app/views/spenders/index.html.erb

SELECT "spenders".* FROM "spenders"
---
      <div class="col-md-6">
        <%= form.text_field :search, value: params[:search], placeholder: t('spenders.search'), class: "form-control" %>

SELECT COUNT(*) FROM "expenses" WHERE "expenses"."spender_id" = 5
SELECT SUM("expenses"."amount") FROM "expenses" WHERE "expenses"."spender_id" = 5
---
              <td><%= spender.name %></td>
              <td><%= spender.expenses.count %></td>
              <td><%= number_to_currency(spender.expenses.sum(:amount), unit: "₴") %></td>