app/views/spenders/show.html.erb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."spender_id" = 1
SELECT 1 AS one FROM "expenses" WHERE "expenses"."spender_id" = 1 LIMIT 1
---
      <dd class="col-sm-9">
        <% if @spender.expenses.any? %>

SELECT "expenses".* FROM "expenses" WHERE "expenses"."spender_id" = 1
---
            <tbody>
              <% @spender.expenses.each do |expense| %>

SELECT SUM("expenses"."amount") FROM "expenses" WHERE "expenses"."spender_id" = 1
---
                <th colspan="2">Загальна сума:</th>
                <td><%= number_to_currency(@spender.expenses.sum(:amount), unit: "₴") %></td>