app/views/spenders/show.html.erb

                <h5 class="card-title"><%= t('spenders.total_sum')%></h5>
                <p class="card-text display-6"><%= number_to_currency(@spender.expenses.sum(:amount), unit: "₴") %></p>
---
SELECT SUM("expenses"."amount") FROM "expenses" WHERE "expenses"."spender_id" = 11

                  <td>
                    <% expense.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "expense_categories" ON "categories"."id" = "expense_categories"."category_id" WHERE "expense_categories"."expense_id" = 20