app/controllers/categories_controller.rb

  def index
    @categories = current_user.categories

    # Пошук
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @categories = @categories.where("name LIKE ?", search_term)
    end

    # Сортування
    sort_column = %w[name].include?(params[:sort]) ? params[:sort] : 'name'
    sort_direction = %w[asc desc].include?(params[:direction]) ? params[:direction] : 'asc'
    @categories = @categories.order("#{sort_column} #{sort_direction}")

    # Пагінація
    @categories = @categories.page(params[:page]).per(10)
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1 ORDER BY name asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "categories" WHERE "categories"."user_id" = 1

    def set_category
      @category = current_user.categories.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1 AND "categories"."id" = 7 LIMIT 1