app/controllers/expenses_controller.rb

  def create
    @expense = Expense.new(expense_params)

    if @expense.save
---
INSERT INTO "expenses" ("amount", "date", "description", "created_at", "updated_at") VALUES (100.5, '2023-10-01', 'Покупка продуктів', '2025-05-14 10:42:06.498344', '2025-05-14 10:42:06.498344') RETURNING "id"

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = 1

    def set_collections
      @categories = Category.all
      @payment_methods = PaymentMethod.all
---
SELECT "categories".* FROM "categories"
SELECT "expense_payment_methods".* FROM "expense_payment_methods" WHERE "expense_payment_methods"."expense_id" = 3
SELECT "payment_methods".* FROM "payment_methods"