app/controllers/expenses_controller.rb

  def index
    @expenses = current_user.expenses

    # Пошук
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @expenses = @expenses.where("description LIKE ?", search_term)
                           .or(current_user.expenses.where(id: current_user.categories.where("name LIKE ?", search_term)
                           .joins(:expenses).select(:expense_id)))
                           .or(current_user.expenses.where(id: current_user.payment_methods.where("name LIKE ?", search_term)
                           .joins(:expenses).select(:expense_id)))
                           .or(current_user.expenses.joins(:spender).where("spenders.name LIKE ?", search_term))
    end

    # Фільтр за категорією
    if params[:category_id].present?
      @expenses = @expenses.joins(:categories).where(categories: { id: params[:category_id], user_id: current_user.id })
    end

    # Фільтр за способом оплати
    if params[:payment_method_id].present?
      @expenses = @expenses.joins(:payment_methods).where(payment_methods: { id: params[:payment_method_id], user_id: current_user.id })
    end

    # Фільтр за платником
    if params[:spender_id].present?
      @expenses = @expenses.where(spender_id: params[:spender_id], user_id: current_user.id )
    end

    # Сортування
    sort_column = %w[date amount description].include?(params[:sort]) ? params[:sort] : 'date'
---
SELECT "spenders".* FROM "spenders" WHERE "spenders"."id" = 15 LIMIT 1
SELECT 1 AS one FROM "expenses" WHERE "expenses"."user_id" = 1 AND ((description LIKE '%Зимова%') OR "expenses"."id" IN (SELECT "expense_id" FROM "categories" INNER JOIN "expense_categories" ON "expense_categories"."category_id" = "categories"."id" INNER JOIN "expenses" ON "expenses"."id" = "expense_categories"."expense_id" WHERE "categories"."user_id" = 1 AND (name LIKE '%Зимова%')) OR "expenses"."id" IN (SELECT "expense_id" FROM "payment_methods" INNER JOIN "expense_payment_methods" ON "expense_payment_methods"."payment_method_id" = "payment_methods"."id" INNER JOIN "expenses" ON "expenses"."id" = "expense_payment_methods"."expense_id" WHERE "payment_methods"."user_id" = 1 AND (name LIKE '%Зимова%'))) LIMIT 1 OFFSET 0
SELECT 1 AS one FROM "categories" WHERE "categories"."name" = 'Їжа' AND "categories"."id" != 1 LIMIT 1
SELECT 1 AS one FROM "expense_payment_methods" WHERE "expense_payment_methods"."expense_id" IS NULL AND "expense_payment_methods"."payment_method_id" = 2 LIMIT 1
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = 1 LIMIT 1
SELECT "expense_payment_methods".* FROM "expense_payment_methods" WHERE "expense_payment_methods"."expense_id" = 1

  def create
    @expense = current_user.expenses.build(expense_params)

    if @expense.save
---
INSERT INTO "expenses" ("amount", "date", "description", "created_at", "updated_at") VALUES (100.5, '2023-10-01', 'Покупка продуктів', '2025-05-14 10:42:06.498344', '2025-05-14 10:42:06.498344') RETURNING "id"

    def set_expense
      @expense = current_user.expenses.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = 1 AND "expenses"."id" = 30 LIMIT 1