app/controllers/import_export_controller.rb

  def import_data(data)
    # Спочатку імпортуємо категорії
    if data['categories'].present?
      data['categories'].each do |category_data|
        current_user.categories.find_or_create_by!(name: category_data['name'])
      end
    end

    # Далі імпортуємо способи оплати
    if data['payment_methods'].present?
      data['payment_methods'].each do |payment_method_data|
        current_user.payment_methods.find_or_create_by!(name: payment_method_data['name'])
      end
    end

    if data['spenders'].present?
      data['spenders'].each do |spender_data|
        current_user.spenders.find_or_create_by!(name: spender_data['name'])
      end
    end

    # Тепер імпортуємо витрати
    if data['expenses'].present?
      data['expenses'].each do |expense_data|
        expense = current_user.expenses.new(
          amount: expense_data['amount'],
          date: expense_data['date'],
          description: expense_data['description']
        )

        if expense_data.dig('spender', 'name').present?
          spender = current_user.spenders.find_by!(name: expense_data['spender']['name'])
---
INSERT INTO "categories" ("user_id", "name", "created_at", "updated_at") VALUES (1, 'Їжа', '2025-05-18 09:53:07.602139', '2025-05-18 09:53:07.602139') RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1 AND "categories"."name" = 'Їжа' LIMIT 1
INSERT INTO "payment_methods" ("user_id", "name", "created_at", "updated_at") VALUES (1, 'Готівка', '2025-05-18 09:53:08.556283', '2025-05-18 09:53:08.556283') RETURNING "id"
SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."user_id" = 1 AND "payment_methods"."name" = 'Готівка' LIMIT 1
INSERT INTO "spenders" ("user_id", "name", "created_at", "updated_at") VALUES (1, 'Анна', '2025-05-18 09:53:09.046578', '2025-05-18 09:53:09.046578') RETURNING "id"
SELECT "spenders".* FROM "spenders" WHERE "spenders"."user_id" = 1 AND "spenders"."name" = 'Анна' LIMIT 1
SELECT 1 AS one FROM "spenders" WHERE "spenders"."name" = 'Анна' LIMIT 1

        # Додаємо категорії
        if expense_data['categories'].present?
          expense_data['categories'].each do |category_data|
            category = current_user.categories.find_by(name: category_data['name'])
            expense.categories << category if category.present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = 1 AND "categories"."name" = 'Їжа' LIMIT 1
INSERT INTO "expense_categories" ("expense_id", "category_id", "created_at", "updated_at") VALUES (2, 1, '2025-05-14 10:46:41.767663', '2025-05-14 10:46:41.767663') RETURNING "id"
INSERT INTO "expenses" ("user_id", "amount", "date", "description", "created_at", "updated_at") VALUES (1, 1500.5, '2023-10-01', 'Покупка продуктів', '2025-05-16 16:02:20.760717', '2025-05-16 16:02:20.760717') RETURNING "id"
SELECT 1 AS one FROM "categories" WHERE "categories"."name" = 'Їжа' AND "categories"."id" != 1 LIMIT 1

        end

        # Додаємо способи оплати
        if expense_data['payment_methods'].present?
          expense_data['payment_methods'].each do |payment_method_data|
            payment_method = current_user.payment_methods.find_by(name: payment_method_data['name'])
            expense.payment_methods << payment_method if payment_method.present?
          end
        end

        expense.save!
---
SELECT 1 AS one FROM "expense_payment_methods" WHERE "expense_payment_methods"."expense_id" IS NULL AND "expense_payment_methods"."payment_method_id" = 2 LIMIT 1
SELECT "payment_methods".* FROM "payment_methods" WHERE "payment_methods"."user_id" = 1 AND "payment_methods"."name" = 'Картка' LIMIT 1
INSERT INTO "expense_payment_methods" ("expense_id", "payment_method_id", "created_at", "updated_at") VALUES (1, 2, '2025-05-18 09:53:11.027241', '2025-05-18 09:53:11.027241') RETURNING "id"
SELECT 1 AS one FROM "payment_methods" WHERE "payment_methods"."name" = 'Картка' AND "payment_methods"."id" != 2 LIMIT 1
INSERT INTO "expenses" ("user_id", "amount", "date", "description", "created_at", "updated_at", "spender_id") VALUES (1, 1500.5, '2023-10-01', 'Покупка продуктів', '2025-05-18 09:53:10.912064', '2025-05-18 09:53:10.912064', 1) RETURNING "id"