app/controllers/payment_methods_controller.rb

  def index
    @payment_methods = current_user.payment_methods

    # Пошук
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @payment_methods = @payment_methods.where("name LIKE ?", search_term)
    end

    # Сортування
    sort_column = %w[name].include?(params[:sort]) ? params[:sort] : 'name'
    sort_direction = %w[asc desc].include?(params[:direction]) ? params[:direction] : 'asc'
    @payment_methods = @payment_methods.order("#{sort_column} #{sort_direction}")
---
SELECT "payment_methods".* FROM "payment_methods"