app/controllers/spenders_controller.rb

SELECT "spenders".* FROM "spenders"
SELECT "spenders".* FROM "spenders" WHERE "spenders"."user_id" = 1 ORDER BY name asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "spenders" WHERE "spenders"."user_id" = 1
---
  def index
    @spenders = current_user.spenders

    # Пошук
    if params[:search].present?
      search_term = "%#{params[:search]}%"
      @spenders = @spenders.where("name LIKE ?", search_term)
    end

    # Сортування
    sort_column = %w[name].include?(params[:sort]) ? params[:sort] : 'name'
    sort_direction = %w[asc desc].include?(params[:direction]) ? params[:direction] : 'asc'
    @spenders = @spenders.order("#{sort_column} #{sort_direction}")

    # Пагінація
    @spenders = @spenders.page(params[:page]).per(10)

SELECT "expenses".* FROM "expenses" WHERE "expenses"."spender_id" = 1
SELECT "expenses".* FROM "expenses" WHERE "expenses"."spender_id" = 5 ORDER BY date desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."spender_id" = 5
---
  def show
    # Сортування витрат платника
    sort_column = %w[date amount description].include?(params[:sort]) ? params[:sort] : 'date'
    sort_direction = %w[asc desc].include?(params[:direction]) ? params[:direction] : 'desc'

    # Отримати пов'язані витрати з сортуванням
    @expenses = @spender.expenses.order("#{sort_column} #{sort_direction}")

    # Пагінація для витрат на сторінці деталей платника
    @expenses = @expenses.page(params[:page]).per(5)

SELECT "spenders".* FROM "spenders" WHERE "spenders"."user_id" = 1 AND "spenders"."id" = 5 LIMIT 1
---
    def set_spender
      @spender = current_user.spenders.find(params[:id])