app/controllers/spenders_controller.rb

SELECT "spenders".* FROM "spenders" WHERE "spenders"."id" = 1 LIMIT 1
---
    def set_spender
      @spender = Spender.find(params[:id])