app/views/categories/index.html.erb

SELECT "categories".* FROM "categories"
---
      <div class="col-md-6">
        <%= form.text_field :search, value: params[:search], placeholder: t('categories.search'), class: "form-control" %>