app/views/expenses/_form.html.erb

SELECT "categories"."id" FROM "categories" INNER JOIN "expense_categories" ON "categories"."id" = "expense_categories"."category_id" WHERE "expense_categories"."expense_id" = 5
---
        <div class="form-check">
          <%= check_box_tag 'expense[category_ids][]', category.id, expense.category_ids.include?(category.id), id: "category_#{category.id}", class: "form-check-input" %>

SELECT 1 AS one FROM "expense_payment_methods" WHERE "expense_payment_methods"."expense_id" IS NULL AND "expense_payment_methods"."payment_method_id" = 1 LIMIT 1
SELECT "payment_methods"."id" FROM "payment_methods" INNER JOIN "expense_payment_methods" ON "payment_methods"."id" = "expense_payment_methods"."payment_method_id" WHERE "expense_payment_methods"."expense_id" = 5
---
        <div class="form-check">
          <%= check_box_tag 'expense[payment_method_ids][]', payment_method.id, expense.payment_method_ids.include?(payment_method.id), id: "payment_method_#{payment_method.id}", class: "form-check-input" %>