app/views/expenses/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "expense_categories" ON "categories"."id" = "expense_categories"."category_id" WHERE "expense_categories"."expense_id" = 30
---
            <td>
              <% expense.categories.each do |category| %>