app/views/expenses/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "expense_categories" ON "categories"."id" = "expense_categories"."category_id" WHERE "expense_categories"."expense_id" = 5
---
      <div class="col-md-3">
        <%= form.collection_select :category_id, Category.all, :id, :name, { include_blank: t('expenses.all_categories') }, { class: "form-select" } %>

SELECT "payment_methods".* FROM "payment_methods"
---
      <div class="col-md-3">
        <%= form.collection_select :payment_method_id, PaymentMethod.all, :id, :name, { include_blank: t('expenses.all_payment_methods') }, { class: "form-select" } %>

SELECT "spenders".* FROM "spenders"
---
      <div class="col-md-2">
        <%= form.collection_select :spender_id, Spender.all, :id, :name, { include_blank: t('expenses.all_spenders') }, { class: "form-select" } %>

SELECT "categories".* FROM "categories" INNER JOIN "expense_categories" ON "categories"."id" = "expense_categories"."category_id" WHERE "expense_categories"."expense_id" = 30
---
              <td>
                <% expense.categories.each do |category| %>

SELECT "payment_methods".* FROM "payment_methods"
---
              <td>
                <% expense.payment_methods.each do |payment_method| %>