app/views/expenses/show.html.erb

      <dd class="col-sm-9">
        <% @expense.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "expense_categories" ON "categories"."id" = "expense_categories"."category_id" WHERE "expense_categories"."expense_id" = 30